public class Summary {

    public static void main(String[] args) {

        // 1. Iterable - правя един клас да бъде обходим, да мога да обхождам един клас! Library implements Iterable<Book>

        // 2. Iterator - вътрешен private клас, който знае как се обхождат елементите
        // на обходимият клас | BookIterator implements Iterator<Book> (hasNext и next)

        // 3. Comparable - прави един клас да бъде сравним (два обекта от този клас се сравняват с метода cat1.compareTo(cat2))
        // сравнението на двата обекта е по даден критерии и резултата е стойност от следните:
        // Отрицателно число: моята котка е "по-малка" по даден критерии от другата котка
        //              Нула: и двете котки са "равни" по даден критерии
        // Положително число: моята котка е "по-голяма" по даден критерии от другата котка

        // 4. Comparator - външен клас, който знае как да сравнява два обекта от един тип по даден критерии
        // BookComparator implements Comparator<Book>
    }
}
